<a href="https://colab.research.google.com/github/charlesamoedo/Data-Science/blob/master/Criando_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Introdução ao pandas
Data Science Direto e na Prática

**Data Science - Criando DataFrame**

Em algum momento pode ser necessário criar DataFrames(DF) para inserção e manipulação dos dados, ou tras palavras, criar na mão um DF.

In [1]:
# importar pandas
import pandas as pd

# Craindo DataFrames (DF) 
Podemos criar DF a partir de qualquer estrutura de dados utilizadas pelo Python, lista, dicionários, array.

**DataFrame a partir de dicionário:** Dicionários são estruturas formadas por pares de chave e valor {key:value}

In [34]:
# criar dicionário
dados_dict ={
    "nome":["Charles","Maria","José","Francisco"],
    "idade":[30,29,47,87],
    "cidade":["Manaus","São Paulo","Rio de Janeiro","Brasília"],
    "comprou":[True,False,True,False]
}

In [17]:
#retronar valores do dicionario
#para retornar uma coluna basta adicionar o nome da mesma dados_dict["nome"]
dados_dict

{'cidade': [True, False, True, False],
 'idade': [30, 29, 47, 87],
 'nome': ['Charles', 'Maria', 'José', 'Francisco']}

In [32]:
# retornar somente as chave .keys() somente valor .values()
dados_dict.keys()
dados_dict.values()

dict_values([['Charles', 'Maria', 'José', 'Francisco'], [30, 29, 47, 87], [True, False, True, False]])

In [35]:
#converter o dicionário em DataFrame
pd.DataFrame(dados_dict)

        nome  idade          cidade  comprou
0    Charles     30          Manaus     True
1      Maria     29       São Paulo    False
2       José     47  Rio de Janeiro     True
3  Francisco     87        Brasília    False

In [36]:
# Atribuir o DataFrame para uma variável
df = pd.DataFrame(dados_dict)

In [37]:
df

        nome  idade          cidade  comprou
0    Charles     30          Manaus     True
1      Maria     29       São Paulo    False
2       José     47  Rio de Janeiro     True
3  Francisco     87        Brasília    False

In [42]:
# O index do DF é a primeira coluna, 0,1,2,3
# começa em 0, termina em 4, sendo que exclui-se o 4
df.index

RangeIndex(start=0, stop=4, step=1)

In [41]:
# Criar uma coluna no DF para identificar o indice
# 1o. Cria uma variável para atribuir os numeros dos indices
id_pessoa =[10,25,30,40]

In [43]:
# atribuindo o indeice criado ao DF
df.index = id_pessoa

In [44]:
df

         nome  idade          cidade  comprou
10    Charles     30          Manaus     True
25      Maria     29       São Paulo    False
30       José     47  Rio de Janeiro     True
40  Francisco     87        Brasília    False

In [47]:
# a partir de agora posso selecionar pelo index (id_pessoa)
df.loc[30]

nome                 José
idade                  47
cidade     Rio de Janeiro
comprou              True
Name: 30, dtype: object

**DataFrame a partir de listas:** Listas são estruturas formadas...

In [48]:
# Criando Lista
dados_lista =[["Charles",35,"Manaus",True],
              ["Raimunda",86,"Brasília",False],
              ["Josá",42,"Rio de Janeiro",True],
              ["Mariana",25,"Belém",False]]

In [50]:
# Criar DF a partir da lista
df = pd.DataFrame(dados_lista)

In [51]:
# Observe abaixo que as colunas vieram numeradas, sem nome, abaixo colocaremos o nome
df

          0   1               2      3
0   Charles  35          Manaus   True
1  Raimunda  86        Brasília  False
2      Josá  42  Rio de Janeiro   True
3   Mariana  25           Belém  False

In [52]:
# Criar DF a partir da lista com nome das colunas
df = pd.DataFrame(dados_lista, columns=["Nome","Idade","Cidade","Comprou"])

In [53]:
# Agora ao imprimir aparecem o nome das colunas
df

       Nome  Idade          Cidade  Comprou
0   Charles     35          Manaus     True
1  Raimunda     86        Brasília    False
2      Josá     42  Rio de Janeiro     True
3   Mariana     25           Belém    False

In [54]:
# Colocar os indices
df.index=['p1','p2','p3','p4']
df

        Nome  Idade          Cidade  Comprou
p1   Charles     35          Manaus     True
p2  Raimunda     86        Brasília    False
p3      Josá     42  Rio de Janeiro     True
p4   Mariana     25           Belém    False

In [55]:
#Localizar um registro,
df.loc['p3']

Nome                 Josá
Idade                  42
Cidade     Rio de Janeiro
Comprou              True
Name: p3, dtype: object

# Adicionar colunas ao DataFrame
Podemos ainda adicionar novas colunas no DF

In [57]:
#Adicionando coluna e atribuindo valor
df['Saldo']=[0.0,1.6,25.6,36.0]

#Visualizar o DF
df

        Nome  Idade          Cidade  Comprou  Saldo
p1   Charles     35          Manaus     True    0.0
p2  Raimunda     86        Brasília    False    1.6
p3      Josá     42  Rio de Janeiro     True   25.6
p4   Mariana     25           Belém    False   36.0

##Alterando nome dos indices e colunas

In [59]:
# altarar nome dos indies
df.index =[21,32,65,65]
df

        Nome  Idade          Cidade  Comprou  Saldo
21   Charles     35          Manaus     True    0.0
32  Raimunda     86        Brasília    False    1.6
65      Josá     42  Rio de Janeiro     True   25.6
65   Mariana     25           Belém    False   36.0

In [61]:
#alterar o nome das colunas
df.columns=['NOME','IDADE','CIDADE','AMAZON','SALDO']
df

        NOME  IDADE          CIDADE  AMAZON  SALDO
21   Charles     35          Manaus    True    0.0
32  Raimunda     86        Brasília   False    1.6
65      Josá     42  Rio de Janeiro    True   25.6
65   Mariana     25           Belém   False   36.0